app/controllers/comments_controller.rb

    def create
        # Query to find post
        @post = Post.find(params[:post_id])

        # Query to create comment based on POST params
        @comment = @post.comments.create(params[:comment].permit(:body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["post_id", 1], ["body", "asdasd"], ["created_at", "2018-06-07 17:55:10.974700"], ["updated_at", "2018-06-07 17:55:10.974700"]]

    def edit
        @comment = current_user.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = ? AND "comments"."id" = ? LIMIT ?  [["user_id", 2], ["id", 27], ["LIMIT", 1]]

    def update

        @comment = current_user.comments.find(params[:id])

        if @comment.update_attributes(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = ? AND "comments"."id" = ? LIMIT ?  [["user_id", 2], ["id", 27], ["LIMIT", 1]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "3000000000000"], ["updated_at", "2018-06-08 08:19:56.974988"], ["id", 27]]

    def destroy
        @post = Post.find(params[:post_id])
        @comment = current_user.comments.find(params[:id])
        @comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = ? AND "comments"."id" = ? LIMIT ?  [["user_id", 2], ["id", 28], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]