app/controllers/posts_controller.rb

SELECT posts.id, posts.title, posts.body, posts.created_at, posts.updated_at, posts.user_id, users.email FROM `posts` INNER JOIN `users` ON `users`.`id` = `posts`.`user_id` ORDER BY posts.id DESC
---
    def index
        @posts = Post.select("posts.id, posts.title, posts.body, posts.created_at, posts.updated_at, posts.user_id, users.email").joins(:user).order("posts.id DESC")

INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "Post One"], ["body", "hehehehe"], ["created_at", "2018-06-07 12:15:24.996946"], ["updated_at", "2018-06-07 12:15:24.996946"]]
---
    def create
        #render plain: params[:post].inspect
        @post = current_user.posts.build(post_params)

        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
    def edit
        @post = current_user.posts.find(params[:id])

SELECT  posts.id, posts.title, posts.body, posts.created_at, posts.updated_at, posts.user_id, users.email FROM "posts" INNER JOIN "users" ON "users"."id" = "posts"."user_id" WHERE (posts.id = '7') ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  comments.id, comments.body, comments.post_id, comments.user_id, comments.created_at, comments.updated_at, users.email FROM "comments" INNER JOIN "users" ON "users"."id" = "comments"."user_id" WHERE (comments.post_id='1') ORDER BY comments.id DESC LIMIT ?  [["LIMIT", 11]]
---
    def show
        # Query for post
        @post = Post.select("posts.id, posts.title, posts.body, posts.created_at, posts.updated_at, posts.user_id, users.email").joins(:user).where("posts.id = ?",params[:id]).last
        puts @post.body
        #@post = Post.find(params[:id])

        # Query for user + comments
        @comments = Comment.select("comments.id, comments.body, comments.post_id, comments.user_id, comments.created_at, comments.updated_at, users.email").joins(:user).where("comments.post_id=?", params[:id]).order("comments.id DESC")

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Post one!"], ["body", "aa"], ["updated_at", "2018-06-07 15:45:14.822353"], ["id", 1]]
---
    def update
        @post = current_user.posts.find(params[:id])

        if @post.update_attributes(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
    def destroy

        post = current_user.posts.find(params[:id])
        #post = current_user.posts.find(params[:id])
        if post.destroy